In [1]:
# importing pandas library
import pandas as pd
 
# Create empty dataframe
df = pd.DataFrame()
 
# Creating a simple dataframe
df['name'] = ['Reema', 'Shyam', 'Jai', 
              'Nimisha', 'Rohit', 'Riya']
df['gender'] = ['Female', 'Male', 'Male', 
                'Female', 'Male', 'Female']
df['age'] = [31, 32, 19, 23, 28, 33]
 
# View dataframe
df

      name  gender  age
0    Reema  Female   31
1    Shyam    Male   32
2      Jai    Male   19
3  Nimisha  Female   23
4    Rohit    Male   28
5     Riya  Female   33

In [2]:
 
# function to find mean
def mean_age_by_group(dataframe, col):
   
    # groups the data by a column and 
    # returns the mean age per group
    return dataframe.groupby(col).mean()
   
# function to convert to uppercase
def uppercase_column_name(dataframe):
   
    # Converts all the column names into uppercase
    dataframe.columns = dataframe.columns.str.upper()
     
    # And returns them
    return dataframe

In [3]:
# Create a pipeline that applies both the functions created above
pipeline = df.pipe(mean_age_by_group, col='gender').pipe(uppercase_column_name)
 
# calling pipeline
pipeline

C:\Users\Luan Lima\AppData\Local\Temp\ipykernel_14204\2579378490.py:6: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  return dataframe.groupby(col).mean()

              AGE
gender
Female  29.000000
Male    26.333333